{
    "SiteTitle": "Devin Kott",
    "Header": {
        "Title": "I'm Devin Kott, a software developer from Denver, Colorado",
        "Summary": "Software Developer with 6 years of experience designing and developing API-driven services for cloud environments. Proficient in C#, Docker, and Bash scripting with prior experience in Python, JavaScript/Node.js/React, and C++. Passionate about building robust, reliable, and secure software while striving to be adaptable to any situation."
    },
    "Work": {
        "SectionTitle": "Work",
        "TotalExp": "Total Industry Experience:",
        "Years": "years"
    },
    "Education": {
        "SectionTitle": "Education",
        "Masters": "Master of Science in Computer Science, Rochester Institute of Technology, 2021",
        "Bachelors": "Bachelor of Science in Computer Science, Rochester Institute of Technology, 2020, Magna Cum Laude"
    },
    "Footer": {
        "YearAndName": "2025 Devin Kott",
        "BuiltWith": "Built with",
        "HostedOn": "Hosted on",
        "Humans": "humans",
        "Robots": "robots"
    },
    "SiteDescription": "Portfolio of Devin Kott, Software Developer",
    "jobs": [
        {
            "title": "Software Engineer (Remote)",
            "company": "Kodak Alaris",
            "startDate": "2021-06-02",
            "endDate": "",
            "responsibilities": [
                "Developer on the technology transformation team, helping modernize existing legacy systems by delivering containerized C# .NET 8.0 microservices designed to run across Linux, Windows, and cloud environments. Owned the development of a scalable, cloud-ready rendering engine utilizing OpenCV for high-performance image processing and photo product creation, replacing legacy imaging code with a modern, robust, maintainable solution. Also led the development of a flexible asset storage service integrating Azure Blob Storage, supporting the broader modernization of product commercialization workflows.",
                "Served as lead developer on our Next-Gen Kiosk retailer trial, architecting and delivering the Low-Latency Net-to-Retail (LLN2R) device service - a C# .NET 8.0 microservice responsible for reliably receiving and processing cloud-driven fulfillment orders from Azure IoT Hub. Designed the service to ensure resilient order ingestion, validation, and print-pipeline execution. Supported deployment readiness through hands-on system configuration and on-site validation of the first store-bound kiosks ahead of retail rollout.",
                "Contributed to the successful delivery of LittlePix Mobile, a Linux- and Docker-based deployment for retail stores in Germany, helping develop an installer and configuration tool to simplify system setup for operators across multiple languages. Supported the company’s modernization efforts by implementing Docker and systemd-based services.",
                "Contributed to the successful delivery of Disneyland Paris’s TinyWorld 360° photo experience, helping develop the file management and rendering components within a containerized microservice architecture using C# .NET 8.0, Linux, and Docker. Supported the company’s modernization efforts by adopting new technologies and integrating them alongside existing systems.",
                "Led a 3-developer team in designing and implementing a 12-month proof-of-concept kiosk architecture, showcasing the advantages of modern technology over legacy systems. Success of the project led to the creation of a new technology transformation team to refactor all product lines.",
                "Integrated Azure Application Insights into kodakmoments.com, providing real-time monitoring and analytics for managers and developers. Leveraged insights to improve site reliability, robustness, and response times."
            ]
        },
        {
            "title": "Software Engineer Co-op",
            "company": "Kodak Alaris",
            "startDate": "2019-05-02",
            "endDate": "2021-02-02",
            "responsibilities": [
                "Co-developed photo kiosk software proof-of-concepts for low-powered IoT devices, prompting the business to further research Linux and Docker as a new technology platform.",
                "Developed an Arduino LED array hardware and software integration for trial kiosk units, including animation tools for UI/UX teams and Azure IoT integration for operational efficiency.",
                "Researched and developed infrared hand-tracking software to enable touchless workflows for existing kiosks, enhancing user interaction and accessibility."
            ]
        },
        {
            "title": "Software Engineer Co-op",
            "company": "Xerox",
            "startDate": "2018-01-02",
            "endDate": "2018-08-02",
            "responsibilities": [
                "Refactored legacy printer simulator software from Java to C++14, improving performance, build times, and maintainability, which increased developer efficiency across multiple teams. Demonstrated simulator improvements to management and development teams in final review meeting."
            ]
        }
    ]
}
